soap_client/SOAPrequest_GetUserInfo.xml

<soapenv:Envelope xmlns:cor="http://bxd.fi/CorporateFileService" xmlns:mod="http://model.bxd.fi" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="CertId-9502902" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">MIID+jCCAuKgAwIBAgIEASJt3DANBgkqhkiG9w0BAQUFADBsMQswCQYDVQQGEwJT
				RTEeMBwGA1UEChMVTm9yZGVhIEJhbmsgQUIgKHB1YmwpMScwJQYDVQQDEx5Ob3Jk
				ZWEgcm9sZS1jZXJ0aWZpY2F0ZXMgQ0EgMDExFDASBgNVBAUTCzUxNjQwNi0wMTIw
				MB4XDTExMDUxNzEyMzQzNVoXDTEzMDUxNzEyMzQzNVowcjELMAkGA1UEBhMCU0Ux
				IDAeBgNVBAMMF05vcmRlYSBEZW1vIENlcnRpZmljYXRlMRQwEgYDVQQEDAtDZXJ0
				aWZpY2F0ZTEUMBIGA1UEKgwLTm9yZGVhIERlbW8xFTATBgNVBAUTDDAwOTU1NzI0
				Mzc3MjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAkR32vnJetMM5pG7VL1lO
				hREmPr6QIVNTkmTe0gQWiL923Jjti2wY/QCbssAKJUQK0apgbHWpTI3ZBjuuVvcT
				4tZaiYtP6sRy8TZqBv2OxDkDf08eErW9nkevOMvvgI0NNSO5qwif2C4+G+n8+AY3
				4QNpbuA9hWD65wImutrkepsCAwEAAaOCASAwggEcMAkGA1UdEwQCMAAwEQYDVR0O
				BAoECEHToLxoFFavMBMGA1UdIAQMMAowCAYGKoVwRwEDMBMGA1UdIwQMMAqACEIF
				jfLBeTpRMDcGCCsGAQUFBwEBBCswKTAnBggrBgEFBQcwAYYbaHR0cDovL29jc3Au
				bm9yZGVhLnNlL1JDQTAxMA4GA1UdDwEB/wQEAwIFoDCBiAYDVR0fBIGAMH4wfKB6
				oHiGdmxkYXA6Ly9sZGFwLm5iLnNlL2NuPU5vcmRlYSUyMHJvbGUtY2VydGlmaWNh
				dGVzJTIwQ0ElMjAwMSxvPU5vcmRlYSUyMEJhbmslMjBBQiUyMChwdWJsKSxjPVNF
				P2NlcnRpZmljYXRlcmV2b2NhdGlvbmxpc3QwDQYJKoZIhvcNAQEFBQADggEBAAAp
				0wveJnANl6aA/fOKFGwDXkkLYlnX+dlP69YAIWVbpl2zkSbc/KJD8qDzpNX1mT0r
				0ECpyc+9Tn2bzvcZnw8Gj5jav/ePQhZPBavaELEBI7HTIDtFI6yDQSAjsHkgsvo2
				7cFnAJMIXlbODeWQlUL2rR8A5AcMBEww0a/NbL7g4wU/ysfSeTWUyPpVqngVDCSd
				FrVpNJijVOF+WdDNfOLl8o8JuoJ1tU0NrdoeIpWtzj1WcEOcbFE87pe2iBdnWeIT
				NjufVlr78x7lheXr1zOOCPn4K+mXhm1/PkyMBc+7E0e2upolksK3q6CCW3VbK68p
				LNnwuUPhdDiQO98rdW8=</wsse:BinarySecurityToken>
				<ds:Signature Id="Signature-22310861" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
						<ds:Reference URI="#id-23633426">
							<ds:Transforms>
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
							<ds:DigestValue>8692c569a1f993c3afaea67a48b8dedeef741130</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>a0Q8g/MOgY3/QZi6TZ3eck+Y5t1wPvKlrh8Laq8I247Bui0pELvUXsdd3muaU6t+
djyNhq3UHlkhYqndRS84eiZafEVwS4Y9k/OIK3/JlSwue2fRRm692i/7sA+QhPxE
foBqVz7MoQsOBMixm5CPIS1YbNfA3+SfyJTVcAZCC0g=
</ds:SignatureValue>
					<ds:KeyInfo Id="KeyId-7874168">
						<wsse:SecurityTokenReference wsu:Id="STRId-2471808" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
							<wsse:Reference URI="#CertId-9502902" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
						</wsse:SecurityTokenReference>
					</ds:KeyInfo>
				</ds:Signature>
			</wsse:Security>
		</soapenv:Header>
		<soapenv:Body wsu:Id="id-23633426" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<cor:getUserInfoin>
				<mod:RequestHeader>
					<mod:SenderId>1</mod:SenderId>
					<mod:RequestId>2</mod:RequestId>
					<mod:Timestamp>2010-06-23T14:00:08Z</mod:Timestamp>
					<mod:Language>FI</mod:Language>
					<mod:UserAgent>Petri</mod:UserAgent>
					<mod:ReceiverId>3</mod:ReceiverId>
				</mod:RequestHeader>
				<mod:ApplicationRequest>PEFwcGxpY2F0aW9uUmVxdWVzdCB4bWxucz0iaHR0cDovL2J4ZC5maS94bWxkYXRh
					LyI+DQogICAgPEN1c3RvbWVySWQ+MTExMTExMTE8L0N1c3RvbWVySWQ+DQogICAg
					PENvbW1hbmQ+R2V0VXNlckluZm88L0NvbW1hbmQ+DQogICAgPFRpbWVzdGFtcD4y
					MDEwLTA5LTEwVDExOjE5OjE0Ljc3MiswMzowMDwvVGltZXN0YW1wPg0KICAgIDxF
					bnZpcm9ubWVudD5QUk9EVUNUSU9OPC9FbnZpcm9ubWVudD4NCiAgICA8U29mdHdh
					cmVJZD5QZXRyaTwvU29mdHdhcmVJZD4NCiAgICA8U2lnbmF0dXJlIHhtbG5zPSJo
					dHRwOi8vd3d3LnczLm9yZy8yMDAwLzA5L3htbGRzaWcjIj4NCiAgICA8U2lnbmVk
					SW5mbz4NCiAgICAgICAgPENhbm9uaWNhbGl6YXRpb25NZXRob2QgQWxnb3JpdGht
					PSJodHRwOi8vd3d3LnczLm9yZy9UUi8yMDAxL1JFQy14bWwtYzE0bi0yMDAxMDMx
					NSNXaXRoQ29tbWVudHMiLz4NCiAgICAgICAgPFNpZ25hdHVyZU1ldGhvZCBBbGdv
					cml0aG09Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvMDkveG1sZHNpZyNyc2Etc2hh
					MSIvPg0KICAgICAgICA8UmVmZXJlbmNlIFVSST0iIj4NCiAgICAgICAgICAgIDxU
					cmFuc2Zvcm1zPg0KICAgICAgICAgICAgICAgIDxUcmFuc2Zvcm0gQWxnb3JpdGht
					PSJodHRwOi8vd3d3LnczLm9yZy8yMDAwLzA5L3htbGRzaWcjZW52ZWxvcGVkLXNp
					Z25hdHVyZSIvPg0KICAgICAgICAgICAgPC9UcmFuc2Zvcm1zPg0KICAgICAgICAg
					ICAgPERpZ2VzdE1ldGhvZCBBbGdvcml0aG09Imh0dHA6Ly93d3cudzMub3JnLzIw
					MDAvMDkveG1sZHNpZyNzaGExIi8+DQogICAgICAgICAgICA8RGlnZXN0VmFsdWU+
					YWEzN2NkNTc4OGQ5NzI1MmI3YWI4MjgwNjhhMTgyNzcwN2JiNDc0ODwvRGlnZXN0
					VmFsdWU+DQogICAgICAgIDwvUmVmZXJlbmNlPg0KICAgIDwvU2lnbmVkSW5mbz4N
					CiAgICA8U2lnbmF0dXJlVmFsdWU+YkMwQUFaL2VDZW1wcFR6aS9Tc0VjRXhka2dQ
					TWNHSnQvVXEyZ0pNUnFZQjBZNy9aWUFDd2JTb3o5c1VydVhDWA0KSmlobzdPVDFL
					aEY1aTZ3NUdlYTJYdUh0TVA3S3Y3bkJTSWZzZk9DUGVFZm1ZZHh2cmNTbW5waStp
					RlB2bkFoTA0KTlRpZXRyb2tIamFsZGJpSW9IckdVNVVyY3E0ckZ6d1NYaDNVTlUr
					aHNKQT0NCjwvU2lnbmF0dXJlVmFsdWU+DQogICAgPEtleUluZm8+DQogICAgICAg
					IDxYNTA5RGF0YT4NCiAgICAgICAgICAgIDxYNTA5Q2VydGlmaWNhdGU+TUlJRCtq
					Q0NBdUtnQXdJQkFnSUVBU0p0M0RBTkJna3Foa2lHOXcwQkFRVUZBREJzTVFzd0NR
					WURWUVFHRXdKVA0KUlRFZU1Cd0dBMVVFQ2hNVlRtOXlaR1ZoSUVKaGJtc2dRVUln
					S0hCMVltd3BNU2N3SlFZRFZRUURFeDVPYjNKaw0KWldFZ2NtOXNaUzFqWlhKMGFX
					WnBZMkYwWlhNZ1EwRWdNREV4RkRBU0JnTlZCQVVUQ3pVeE5qUXdOaTB3TVRJdw0K
					TUI0WERURXhNRFV4TnpFeU16UXpOVm9YRFRFek1EVXhOekV5TXpRek5Wb3djakVM
					TUFrR0ExVUVCaE1DVTBVeA0KSURBZUJnTlZCQU1NRjA1dmNtUmxZU0JFWlcxdklF
					TmxjblJwWm1sallYUmxNUlF3RWdZRFZRUUVEQXREWlhKMA0KYVdacFkyRjBaVEVV
					TUJJR0ExVUVLZ3dMVG05eVpHVmhJRVJsYlc4eEZUQVRCZ05WQkFVVEREQXdPVFUx
					TnpJMA0KTXpjM01qQ0JuekFOQmdrcWhraUc5dzBCQVFFRkFBT0JqUUF3Z1lrQ2dZ
					RUFrUjMydm5KZXRNTTVwRzdWTDFsTw0KaFJFbVByNlFJVk5Ua21UZTBnUVdpTDky
					M0pqdGkyd1kvUUNic3NBS0pVUUswYXBnYkhXcFRJM1pCanV1VnZjVA0KNHRaYWlZ
					dFA2c1J5OFRacUJ2Mk94RGtEZjA4ZUVyVzlua2V2T012dmdJME5OU081cXdpZjJD
					NCtHK244K0FZMw0KNFFOcGJ1QTloV0Q2NXdJbXV0cmtlcHNDQXdFQUFhT0NBU0F3
					Z2dFY01Ba0dBMVVkRXdRQ01BQXdFUVlEVlIwTw0KQkFvRUNFSFRvTHhvRkZhdk1C
					TUdBMVVkSUFRTU1Bb3dDQVlHS29Wd1J3RURNQk1HQTFVZEl3UU1NQXFBQ0VJRg0K
					amZMQmVUcFJNRGNHQ0NzR0FRVUZCd0VCQkNzd0tUQW5CZ2dyQmdFRkJRY3dBWVli
					YUhSMGNEb3ZMMjlqYzNBdQ0KYm05eVpHVmhMbk5sTDFKRFFUQXhNQTRHQTFVZER3
					RUIvd1FFQXdJRm9EQ0JpQVlEVlIwZkJJR0FNSDR3ZktCNg0Kb0hpR2RteGtZWEE2
					THk5c1pHRndMbTVpTG5ObEwyTnVQVTV2Y21SbFlTVXlNSEp2YkdVdFkyVnlkR2xt
					YVdOaA0KZEdWekpUSXdRMEVsTWpBd01TeHZQVTV2Y21SbFlTVXlNRUpoYm1zbE1q
					QkJRaVV5TUNod2RXSnNLU3hqUFZORg0KUDJObGNuUnBabWxqWVhSbGNtVjJiMk5o
					ZEdsdmJteHBjM1F3RFFZSktvWklodmNOQVFFRkJRQURnZ0VCQUFBcA0KMHd2ZUpu
					QU5sNmFBL2ZPS0ZHd0RYa2tMWWxuWCtkbFA2OVlBSVdWYnBsMnprU2JjL0tKRDhx
					RHpwTlgxbVQwcg0KMEVDcHljKzlUbjJienZjWm53OEdqNWphdi9lUFFoWlBCYXZh
					RUxFQkk3SFRJRHRGSTZ5RFFTQWpzSGtnc3ZvMg0KN2NGbkFKTUlYbGJPRGVXUWxV
					TDJyUjhBNUFjTUJFd3cwYS9OYkw3ZzR3VS95c2ZTZVRXVXlQcFZxbmdWRENTZA0K
					RnJWcE5KaWpWT0YrV2RETmZPTGw4bzhKdW9KMXRVME5yZG9lSXBXdHpqMVdjRU9j
					YkZFODdwZTJpQmRuV2VJVA0KTmp1ZlZscjc4eDdsaGVYcjF6T09DUG40SyttWGht
					MS9Qa3lNQmMrN0UwZTJ1cG9sa3NLM3E2Q0NXM1ZiSzY4cA0KTE5ud3VVUGhkRGlR
					Tzk4cmRXOD08L1g1MDlDZXJ0aWZpY2F0ZT4NCiAgICAgICAgICAgIDxYNTA5SXNz
					dWVyU2VyaWFsPg0KICAgICAgICAgICAgICAgIDxYNTA5SXNzdWVyTmFtZT4yLjUu
					NC41PSMxMzBiMzUzMTM2MzQzMDM2MmQzMDMxMzIzMCxDTj1Ob3JkZWEgcm9sZS1j
					ZXJ0aWZpY2F0ZXMgQ0EgMDEsTz1Ob3JkZWEgQmFuayBBQiAocHVibCksQz1TRTwv
					WDUwOUlzc3Vlck5hbWU+DQogICAgICAgICAgICAgICAgPFg1MDlTZXJpYWxOdW1i
					ZXI+MTkwMzM1NjQ8L1g1MDlTZXJpYWxOdW1iZXI+DQogICAgICAgICAgICA8L1g1
					MDlJc3N1ZXJTZXJpYWw+DQogICAgICAgIDwvWDUwOURhdGE+DQogICAgPC9LZXlJ
					bmZvPg0KPC9TaWduYXR1cmU+DQo8L0FwcGxpY2F0aW9uUmVxdWVzdD4=
				</mod:ApplicationRequest>
			</cor:getUserInfoin>
		</soapenv:Body>
	</soapenv:Envelope>
